function [LSF] = GetLSF(ESF)
% Отримання функції розсіювання лінії
% LSF - функція розсіювання лінії
% ESF - функція розсіювання краю, крайова функція

% отримуємо ФРЛ 
LSF = abs(diff(ESF));
LSF = LSF / max(LSF);

% Примітка! В багатьох статтях цифрової обробки приведені графіки
% LSF, де відображаються значення менші 0!!! І так, розберемося, чому.
% Виходячи із числових методів, похідна це "грубо кажучи" віднімання від
% наступного значення теперішнє, якщо рухатися по точках. Різниця може
% становити більше і менше нуля, але це математика! Переходячи в область
% фізики, бажано знати і розбиратися в таких розділах як Хвильова і
% Дифракційна оптика. Що таке взагалі ФРЛ (функція розсіювання лінії), так
% це один із видів імпульстних відгуків системи на вхідний сигнал,
% аналогічно ФРТ (функції розсіювання точки), але це також математичне
% формулювання. Фізично, ми беремо 2 леза і зближуємо один до одного
% якомога ближче, щоб утворити максимально тонку щілину, далі світимо
% монохроматичним випромінюванням на щілинну діафрагму. В результаті на
% основі законів дифракційної оптики на екрані ми можемо помітити ФРЛ,
% (процес утворення цієї картини називається інтерференцією), в
% "перерізі" вона буде схожа на sinc - функцію. Отже на екрані ми бачимо
% розподіл інтенсивності світла - темні і світлі "смуги". Отже якщо світло
% наявне в деякій точці екрану то можна записати "I" (інтенсивність) або
% "Е" (освітленість), яка буде більше 0 - так як є світло. Якщо смуга чи
% певна точка темна - тобто світло відсутнє, то записуємо 0. Постає
% питання, як фізично охарактеризувати від'ємні значення? Що воно фізично
% собою представляє? Як це реалізувати фізично? В опиці притримуються в 
% першу чергу фізичної відповідності. А різні математичні функції, це
% найбільш близькі і не завжди точні методи оцінки, представлення і
% розрахунку результатів! Наприклад: рис. Line Spread Function (LSF)
% http://www.imatest.com/docs/sfr_mtfplot/
% Щоб ввести в оману там убрали розмірність, але і неозброєним оком помітно
% описаний вище недолік.
% Отже, не потрібно плутати амплітуду поля (див. файл Екранування в
% оптичних системах або книгу https://ooep.kpi.ua/d_difr.html,
% https://ooep.kpi.ua/book/kol_lih_book.html), яка може 
% набувати від'ємних значень з ФРТ або ФРЛ.

% Також, зазвичай ФРТ і ФРЛ представляють у нормованому вигляді.

end
