function [MTF, f] = GetMTF(LSF)
%Отримання МПФ
% LSF - функція розсіювання лінії
% MTF - модуляційна передавальна функція

% Отримаємо МПФ
MTF = abs(fft(LSF));

% змінюємо розмір
f = 1 : fix(size(MTF, 2)/ 2) + 1;
MTF = MTF(f);

% Нормуємо МПФ
MTF = MTF / max(MTF);

% в даному випадку ми отримуємо c/p цикли/піксель, відкривши властивості 
% файлу і найшовши додаткову інформацію можна записати:
% Nikon D500: https://ru.wikipedia.org/wiki/Nikon_D500
% Матрица, формат: DX, тип: КМОП, размер: 23,5x15,7 мм
% Разрешение  5568 x 3712, 20,9 мегапикселей
f = 2 * (f - 1) * 3712 / max(f);

% По розмырності: 
% http://www.imatest.com/docs/sfr_MTFplot/
% http://www.imatest.com/docs/sharpness/
% http://www.imatest.com/docs/sharpness/imatest-slanted-edge-results/

% Примітка. Аналогічно функції розсіювання лінії ФРЛ/LSF.
% Якщо проналізувати наприклад сайт, а точніше рис:
% Typical edge, uncorrected MTF. та Typical edge, LSF-corrected MTF.
% http://www.imatest.com/2015/04/lsf-correction-factor-for-slanted-edge-mtf-measurements/
% http://popoval.ru/videotests/imatest/index.html
% Аналогічно постає питання розуміння самої предметної облсті "оптика".
% Питання з боку фізики: "Як досягти контрасту більше 1?" Тобто, це
% говорить. що оптична система з абераціями, з неідеальним імпусльним
% відгуком ФРЛ/ФРТ формує зображення кращої якості ніж реальний об'єкт?
% Це арпіорі неможливо! І констраст не може бути більше 0 або менше нуля!
% Також, розглянемо нормування графіка МПФ. Що взагілі означає нормування?
% Нормований графік/крива це відношення кожного значення ненормованої МПФ
% до її МАКСИМАЛЬНОГО значення. Тобто, коли розглядається дифракційна
% оптична теорія, то там розглядаються відносно "ідельні" функції, без
% якихось шумів, і зазвичай максимальне значення функції знаходиться на
% початку координати, тобто в нульовій точці MTF(0) (при нульовій частоті),
% і знаючи це, немає потреба розглядати всю криву і шукати в ній
% максимальне значення, тому зразу записують у формулах:
% MTFn(f) = MFT(f) / MFT(0).
% Більш точніше формула MTFn(f) = |OTF(f) / OTF(0)| де OTF - опрична
% передавальна функція і вона комплекста, диф. надісланий файл з власним
% виведенням МПФ з і без екранування "Екранування в оптичних системах"
% У випадку ж того, що зазвичай представляють на різних сайтах - це не
% відповідає дійсності/фізичному смислу.

end

